app/views/admin_searches/show.html.erb


<% if @admin_search.adminsearch_books.empty? %>
---
SELECT "books".* FROM "books" WHERE (isbn LIKE '%%' and title LIKE '%Book1%' and author LIKE '%%' )
SELECT 1 AS one FROM "books" WHERE (isbn LIKE '%%' and title LIKE '%Book1%' and author LIKE '%%' ) LIMIT ?  [["LIMIT", 1]]


  <%	@admin_search.adminsearch_books.each do	|book|	%>
---
SELECT "books".* FROM "books" WHERE (isbn LIKE '%%' and title LIKE '%Book1%' and author LIKE '%%' )