app/views/patron_searches/show.html.erb


<% if @patron_search.patronsearch_books.empty? %>
---
SELECT "books".* FROM "books" WHERE (isbn LIKE '%%' and title LIKE '%Book1%' and author LIKE '%%' )
SELECT 1 AS one FROM "books" WHERE (isbn LIKE '%%' and title LIKE '%Book1%' and author LIKE '%%' ) LIMIT ?  [["LIMIT", 1]]


  <%	@patron_search.patronsearch_books.each do	|book|	%>
---
SELECT "books".* FROM "books" WHERE (isbn LIKE '%%' and title LIKE '%Book1%' and author LIKE '%%' )