app/views/searches/show.html.erb

SELECT "books".* FROM "books" WHERE (isbn LIKE '%%' and title LIKE '%Book1%' and author LIKE '%%' )
SELECT 1 AS one FROM "books" WHERE (isbn LIKE '%%' and title LIKE '%Book%' and author LIKE '%%' ) LIMIT ?  [["LIMIT", 1]]
---

<% if @search.search_books.empty? %>

SELECT "books".* FROM "books" WHERE (isbn LIKE '%%' and title LIKE '%Book%' and author LIKE '%%' )
---

  <%	@search.search_books.each do	|book|	%>