app/controllers/admin_searches_controller.rb

INSERT INTO "admin_searches" ("title", "author", "isbn", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Book1"], ["author", ""], ["isbn", ""], ["created_at", "2020-12-06 22:36:06.417046"], ["updated_at", "2020-12-06 22:36:06.417046"]]
---
  def create
    @admin_search = AdminSearch.create(search_params)

SELECT "admin_searches".* FROM "admin_searches" WHERE "admin_searches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @admin_search = AdminSearch.find(params[:id])