app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "isbn", "copies", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Book1"], ["author", "Me"], ["isbn", "1234567890"], ["copies", 2], ["created_at", "2020-12-03 05:41:43.641217"], ["updated_at", "2020-12-03 05:41:43.641217"]]
---
  def create
    @book = Book.new(params.require(:book).permit(:title, :author, :isbn, :copies))
    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "isbn" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["isbn", "12345678905"], ["updated_at", "2020-12-07 01:05:20.576939"], ["id", 1]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(params.require(:book).permit(:title, :author, :isbn, :copies))

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "copies" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["copies", 1], ["updated_at", "2020-12-07 04:09:30.846141"], ["id", 1]]
---
  def checkout
    @book = Book.find(params[:id])
    if @book.copies > 0
      @book.checkout
      @book.save!