app/controllers/patron_searches_controller.rb

INSERT INTO "patron_searches" ("title", "author", "isbn", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Book1"], ["author", ""], ["isbn", ""], ["created_at", "2020-12-06 22:47:23.322016"], ["updated_at", "2020-12-06 22:47:23.322016"]]
---
  def create
    @patron_search = PatronSearch.create(search_params)

SELECT "patron_searches".* FROM "patron_searches" WHERE "patron_searches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @patron_search = PatronSearch.find(params[:id])