app/controllers/reviews_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("name", "body", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "R5"], ["body", "Im done"], ["book_id", 1], ["created_at", "2020-12-07 04:49:34.300732"], ["updated_at", "2020-12-07 04:49:34.300732"]]
---
  def create
    @book = Book.find(params[:book_id])
    @review = @book.reviews.create(params.require(:review).permit(:name, :body))