app/controllers/searches_controller.rb

INSERT INTO "searches" ("title", "author", "isbn", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Book1"], ["author", ""], ["isbn", ""], ["created_at", "2020-12-03 05:48:35.277475"], ["updated_at", "2020-12-03 05:48:35.277475"]]
---
  def create
    @search = Search.create(search_params)

SELECT "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @search = Search.find(params[:id])